; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	satellite7 - satellite
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	infrared1 - mode
	thermograph0 - mode
	Star3 - direction
	Star0 - direction
	Star1 - direction
	GroundStation4 - direction
	Star2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star3)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star1)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument9 thermograph0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star0)
	(supports instrument10 thermograph0)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star0)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
	(supports instrument11 infrared1)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 GroundStation4)
	(supports instrument12 infrared1)
	(calibration_target instrument12 Star0)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star0)
	(supports instrument13 thermograph0)
	(supports instrument13 infrared1)
	(calibration_target instrument13 Star0)
	(supports instrument14 thermograph0)
	(supports instrument14 infrared1)
	(calibration_target instrument14 Star1)
	(supports instrument15 infrared1)
	(supports instrument15 thermograph0)
	(calibration_target instrument15 Star2)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet10)
	(supports instrument16 thermograph0)
	(supports instrument16 infrared1)
	(calibration_target instrument16 Star2)
	(supports instrument17 infrared1)
	(calibration_target instrument17 GroundStation4)
	(supports instrument18 infrared1)
	(supports instrument18 thermograph0)
	(calibration_target instrument18 Star2)
	(on_board instrument16 satellite7)
	(on_board instrument17 satellite7)
	(on_board instrument18 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star3)
)
(:goal (and
	(have_image Phenomenon5 thermograph0)
	(have_image Planet6 thermograph0)
	(have_image Star7 infrared1)
	(have_image Star8 thermograph0)
	(have_image Phenomenon9 infrared1)
	(have_image Planet10 thermograph0)
	(have_image Planet11 infrared1)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 7
2. (calibrate satellite4 instrument10 star0)
   added: (calibrated instrument10)
   goals met: 0 of 7
3. (turn_to satellite4 planet6 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 planet6)
   goals met: 0 of 7
4. (take_image satellite4 planet6 instrument10 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 1 of 7
5. (turn_to satellite4 planet11 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet11)
   goals met: 1 of 7
6. (take_image satellite4 planet11 instrument10 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 2 of 7
7. (turn_to satellite4 planet10 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet10)
   goals met: 2 of 7
8. (take_image satellite4 planet10 instrument10 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 3 of 7
9. (turn_to satellite4 phenomenon9 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 phenomenon9)
   goals met: 3 of 7
10. (take_image satellite4 phenomenon9 instrument10 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 4 of 7
11. (turn_to satellite4 phenomenon5 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 phenomenon5)
   goals met: 4 of 7
12. (take_image satellite4 phenomenon5 instrument10 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   goals met: 5 of 7
13. (turn_to satellite4 star7 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 star7)
   goals met: 5 of 7
14. (take_image satellite4 star7 instrument10 infrared1)
   added: (have_image star7 infrared1)
   goals met: 6 of 7
15. (turn_to satellite4 star8 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star8)
   goals met: 6 of 7
16. (take_image satellite4 star8 instrument10 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 7 of 7
